Revit 2027 API
PropertyLine.SetStart Method
 Sets the start of point of a table-based PropertyLine element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetStart(
	XYZ start
)
Public Sub SetStart (
	start As XYZ
)
public:
void SetStart(
	XYZ^ start
)
member SetStart :
        start : XYZ -> unit
Parameters
start XYZ
 The new start point.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  PropertyLine is not table-based. -or- Failed to set start for the property line element if it is sketch-based property line element.
See Also
Reference
PropertyLine Class
Autodesk.Revit.DB Namespace